In [4]:
import pandas as pd
import numpy as np

In [6]:
a = [1,2,4]
b= ['a','b','c']
c=  np.array(a)
d = {'a':10,'b':20,'c':30}

In [11]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
pd.Series(a,b)

a    1
b    2
c    4
dtype: int64

In [23]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [25]:
ser1 = pd.Series([1,2,3,4],['ram','shyam','hari','sita'])

In [27]:
ser1

ram      1
shyam    2
hari     3
sita     4
dtype: int64

In [28]:
ser2 = pd.Series([1,2,5,4],['ram','shyam','owl','sita'])

In [30]:
ser2

ram      1
shyam    2
owl      5
sita     4
dtype: int64

In [32]:
ser2['ram']

1

In [1]:
ser1+ser2

NameError: name 'ser1' is not defined

In [9]:
from numpy.random import randn
import numpy as np
import pandas as pd

In [5]:
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [20]:
type(df[['W','X']])

pandas.core.frame.DataFrame

In [21]:
df['new'] = df['X']+df['Y']

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [29]:
df.drop('new',axis=1,inplace=True)

In [31]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [32]:
df.drop('E')

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057

In [34]:
df.shape

(5, 3)

In [36]:
df.loc['C']

X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [38]:
df.iloc[2]

X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [41]:
df.loc['A','Y']

0.9079694464765431

In [42]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077